export default [
  {
    id: 0,
    title: 'قصه پاراف',
    description: [
      {
        text: 'بزرگترها می‌گویند آن قدیم‌ها قول آدم‌ها از سرهایشان هم سنگین‌تر بود و اگر سرشان هم به بادی می‌رفت، قولشان نمی‌رفت. بعدترها انگار قول آدم‌ها کمتر سنگین بود. ممکن بود باد بلندی بوزد و قولی برود! اما قول‌ها مهم بودند. قول‌ها مهم هستند. آنقدر که نمی‌شد از قول‌هایی که کمتر سنگین بودند و با بادها بلند می‌شدند، مراقبت نکرد! ما برای قول‌ها که مهم هستند و با دیدن بادها که بلندند، بر آن شدیم تا دست و پای قول‌ها را بند زمین کنیم. مباد بادهای بلند ببرندشان و قول‌های سنگین از یاد زمین برود.',
        miniText: 'پاراف، برای قول‌های ما که بر باد نرود!',
        children: [],
      },
    ],
  },

  {
    id: 2,
    title: 'معرفی پاراف',
    description: [
      {
        text: 'پاراف پلتفرمی برای امضاء الکترونیک اسناد و فایل‌هاست که پس از احرازهویت اشخاص،امکان امضاء الکترونیک را برای ایشان فراهم می‌آورد. بنابراین امضاء الکترونیک منتسب به شخص امضاءکننده بوده، فرآیند غیرحضوری امضاء از جانب ایشان، جایگزین فرآیند حضوری جهت امضاء شده و نه تنها از همان اعتبار امضای اسناد برخوردار است که اغلب اعتباری بیش‌تر و در سطح اعتبار اسناد رسمی دارد. ',
        children: [],
      },
    ],
  },
  {
    id: 3,
    title: 'مفاهیم و تعاریف ',
    description: [
      {
        text: '',
        children: [
          {
            title: 'پاراف: ',
            description:
              'نرم‌افزاری است که به منظور ارائه خدمات مرتبط با امضاء الکترونیک به کاربر طراحی شده و توسعه یافته است.',
            listType: '',
          },
          {
            title: 'کاربر: ',
            description:
              'شخص حقیقی یا حقوقی است که امکان بهره‌مندی از خدمات ارائه‌شده در پاراف از طریق حساب کاربری برای ایشان میسر شده است. ',
            listType: '',
          },
          {
            title: 'مخاطب سند: ',
            description:
              'شخص حقیقی یا حقوقی است که به درخواست کاربر نسبت به امضاء سند اقدام می‌نماید.',
            listType: '',
          },
          {
            title: 'سطوح احراز هویت: ',
            description:
              'منظور فرآیندی است که مطابق آن اصالت و صحت هویت کاربر و مخاطب سند که امضاءکنندگان آتی سند شناخته می‌شوند، تایید می‌شود. سطوح احراز هویت دارای پنج مرحله است که با استفاده از زیرساخت‌های سرزمین هوشمند پاد انجام شده و در ادامه به آن اشاره می‌شود:',
            listType: '',
            children: [
              {
                title: 'سطح اول تا سوم: ',
                description:
                  'احراز هویت مبتنی بر مشخصات فردی (کد ملی و تاریخ تولد) و انطباق آن با مالکیت سیم‌کارت از طریق ارسال رمز یک بار مصرف. ',
                listType: '',
              },
              {
                title: 'سطح چهارم: ',
                description:
                  'احراز هویت بیومتریک مبتنی بر انطباق داده‌های دریافتی از ویدیوی زندۀ کاربر با اطلاعات موجود در ثبت احوال.',
                listType: '',
              },
              {
                title: 'سطح پنجم: ',
                description: 'احراز هویت حضوری در تمام شعب بانک پاسارگاد.',
                listType: '',
              },
            ],
          },
          {
            title: 'حساب کاربری: ',
            description:
              'زیرساخت نرم‌افزاری که امکان ارتباط کاربر با پاراف را فراهم نموده و کاربر می‌تواند از طریق آن، خدمات ارائه‌شده در پاراف را دریافت نماید.',
            listType: '',
          },
          {
            title: 'سند: ',
            description:
              'نسخه الکترونیکی از آنچه کاربر به منظور امضاء آن، در پاراف بارگذاری می‌نماید.',
            listType: '',
          },
          {
            title: 'امضاءکننده: ',
            description:
              'هر شخص حقیقی یا حقوقی است که از پاراف برای امضاء الکترونیکی استفاده می‌نماید. چنانچه کاربر از طریق حساب کاربری خود اقدام به امضاء سند نماید، امضاءکننده محسوب می‌شود.',
            listType: '',
          },
          {
            title: 'امضاء الکترونیک: ',
            description:
              'هر نوع علامت منضم‌شده یا به نحو منطقی متصل‌شده به سند است که برای شناسایی امضاءکننده سند مورد استفاده قرار می‌گیرد.',
            listType: '',
          },
          {
            title: 'گواهی امضاء الکترونیک مرکز ریشه: ',
            description:
              'گواهی است که درصورت درخواست کاربر مبنی بر امضاء الکترونیک مطمئن اسناد از طریق زیرساخت متمرکز مرکز توسعه تجارت الکترونیکی و با طی فرآیند مشخص شده و پرداخت هزینه‌ای که به اطلاع ایشان می‌رسد، در اختیار ایشان قرار گرفته و برای امضاء الکترونیک مطمئن در اسناد به کار می‌رود.',
            listType: '',
          },
        ],
      },
    ],
  },

  {
    id: 4,
    title: 'خدمات پاراف',
    description: [
      {
        text: 'ایجاد حساب کاربری برای هر کاربر',
      },
      {
        text: 'احراز هویت کاربر',
      },
      {
        text: 'مدیریت اسناد',
      },
      {
        text: 'رمزنگاری اسناد',
      },
      {
        text: 'ایجاد اسناد با قابلیت امضاء یک یا چند طرفه',
      },
      {
        text: 'تهیه فرایندهای امضای پرتکرار',
      },
      {
        text: 'مدیریت سطوح دسترسی اشخاص حقوقی ',
      },
      {
        text: 'تهیه گزارش‌های مدیریتی',
      },
    ],
  },
];
