import React from 'react';
import {View, Text, ScrollView, StatusBar, Image} from 'react-native';
import {useNavigation} from '@react-navigation/native';
import AppLogoTitle from '../../components/appLogoTitle';
import Button from '../../components/button';
import styles from './style';

const Index: React.FC = () => {
  const {goBack} = useNavigation();

  return (
    <>
      <StatusBar hidden={true} />
      <Image
        source={require('../../assets/img/auth_page_top_wave.png')}
        style={styles.topWaveImg}
      />
      <View style={styles.wrapper}>
        <View style={{padding: 0, height: 30}}>
          <AppLogoTitle />
        </View>
        <View style={styles.rulesAndConditionsWrapper}>
          <ScrollView>
            <View style={{paddingHorizontal: 12}}>
              <Text style={styles.title}>بسمه تعالی</Text>
              <Text>&nbsp;</Text>
              <Text style={styles.textTitle}>قصه پاراف</Text>
              <Text style={styles.conditionText}>
                بزرگترها می‌گویند آن قدیم‌ها قول آدم‌ها از سرهایشان هم سنگین‌تر
                بود و اگر سرشان هم به بادی می‌رفت، قولشان نمی‌رفت. بعدترها انگار
                قول آدم‌ها کمتر سنگین بود. ممکن بود باد بلندی بوزد و قولی برود!
                اما قول‌ها مهم بودند. قول‌ها مهم هستند. آنقدر که نمی‌شد از
                قول‌هایی که کمتر سنگین بودند و با بادها بلند می‌شدند، مراقبت
                نکرد! ما برای قول‌ها که مهم هستند و با دیدن بادها که بلندند، بر
                آن شدیم تا دست و پای قول‌ها را بند زمین کنیم. مباد بادهای بلند
                ببرندشان و قول‌های سنگین از یاد زمین برود.
              </Text>
              <Text style={styles.conditionText}>
                <Text>پاراف</Text>، برای قول‌های ما که بر باد نرود!
              </Text>
              <Text>&nbsp;</Text>
              <Text style={styles.textTitle}>معرفی پاراف</Text>
              <Text style={styles.conditionText}>
                پاراف پلتفرمی برای امضاء الکترونیک اسناد و فایل‌هاست که پس از
                احرازهویت اشخاص،امکان امضاء الکترونیک را برای ایشان فراهم
                می‌آورد. بنابراین امضاء الکترونیک منتسب به شخص امضاءکننده بوده،
                فرآیند غیرحضوری امضاء از جانب ایشان، جایگزین فرآیند حضوری جهت
                امضاء شده و نه تنها از همان اعتبار امضای اسناد برخوردار است که
                اغلب اعتباری بیش‌تر و در سطح اعتبار اسناد رسمی دارد.
              </Text>
              <Text>&nbsp;</Text>
              <Text style={styles.textTitle}>مفاهیم و تعاریف </Text>
              <View style={{paddingRight: 15}}>
                <Text style={styles.conditionText}>
                  <Text>پاراف: </Text>نرم‌افزاری است که به منظور ارائه خدمات
                  مرتبط با امضاء الکترونیک به کاربر طراحی شده و توسعه یافته است.
                </Text>
                <Text style={styles.conditionText}>
                  <Text>کاربر: </Text>شخص حقیقی یا حقوقی است که امکان بهره‌مندی
                  از خدمات ارائه‌شده در پاراف از طریق حساب کاربری برای ایشان
                  میسر شده است.
                </Text>
                <Text style={styles.conditionText}>
                  <Text>مخاطب سند: </Text>شخص حقیقی یا حقوقی است که به درخواست
                  کاربر نسبت به امضاء سند اقدام می‌نماید.
                </Text>
                <Text style={styles.conditionText}>
                  <Text>سطوح احراز هویت: </Text>منظور فرآیندی است که مطابق آن
                  اصالت و صحت هویت کاربر و مخاطب سند که امضاءکنندگان آتی سند
                  شناخته می‌شوند، تایید می‌شود. سطوح احراز هویت دارای پنج مرحله
                  است که با استفاده از زیرساخت‌های سرزمین هوشمند پاد انجام شده و
                  در ادامه به آن اشاره می‌شود:
                </Text>
                <Text style={styles.conditionText}>
                  <Text>سطح اول تا سوم:</Text> احراز هویت مبتنی بر مشخصات فردی
                  (کد ملی و تاریخ تولد) و انطباق آن با مالکیت سیم‌کارت از طریق
                  ارسال رمز یک بار مصرف.
                </Text>
                <Text style={styles.conditionText}>
                  <Text>سطح چهارم:</Text> احراز هویت بیومتریک مبتنی بر انطباق
                  داده‌های دریافتی از ویدیوی زندۀ کاربر با اطلاعات موجود در ثبت
                  احوال.
                </Text>
                <Text style={styles.conditionText}>
                  <Text>سطح پنجم:</Text> احراز هویت حضوری در تمام شعب بانک
                  پاسارگاد.
                </Text>
              </View>
              <Text>
                <Text>&nbsp;</Text>
              </Text>
              <View style={{paddingRight: 15}}>
                <Text style={styles.conditionText}>
                  <Text>حساب کاربری: </Text>زیرساخت نرم‌افزاری که امکان ارتباط
                  کاربر با پاراف را فراهم نموده و کاربر می‌تواند از طریق آن،
                  خدمات ارائه‌شده در پاراف را دریافت نماید.
                </Text>
                <Text style={styles.conditionText}>
                  <Text>سند:</Text> نسخه الکترونیکی از آنچه کاربر به منظور امضاء
                  آن، در پاراف بارگذاری می‌نماید.
                </Text>
                <Text style={styles.conditionText}>
                  <Text>امضاءکننده: </Text>هر شخص حقیقی یا حقوقی است که از پاراف
                  برای امضاء الکترونیکی استفاده می‌نماید. چنانچه کاربر از طریق
                  حساب کاربری خود اقدام به امضاء سند نماید، امضاءکننده محسوب
                  می‌شود.
                </Text>
                <Text style={styles.conditionText}>
                  <Text>امضاء الکترونیک: </Text>هر نوع علامت منضم‌شده یا به نحو
                  منطقی متصل‌شده به سند است که برای شناسایی امضاءکننده سند مورد
                  استفاده قرار می‌گیرد.
                </Text>
                <Text style={styles.conditionText}>
                  <Text>گواهی امضاء الکترونیک مرکز ریشه: </Text>گواهی است که
                  درصورت درخواست کاربر مبنی بر امضاء الکترونیک مطمئن اسناد از
                  طریق زیرساخت متمرکز مرکز توسعه تجارت الکترونیکی و با طی فرآیند
                  مشخص شده و پرداخت هزینه‌ای که به اطلاع ایشان می‌رسد، در اختیار
                  ایشان قرار گرفته و برای امضاء الکترونیک مطمئن در اسناد به کار
                  می‌رود.
                </Text>
              </View>
              <Text>
                <Text>&nbsp;</Text>
              </Text>
              <Text style={styles.textTitle}>خدمات پاراف</Text>
              <View style={{paddingRight: 15}}>
                <Text style={styles.conditionText}>
                  ایجاد حساب کاربری برای هر کاربر
                </Text>
                <Text style={styles.conditionText}>احراز هویت کاربر</Text>
                <Text style={styles.conditionText}>مدیریت اسناد</Text>
                <Text style={styles.conditionText}>رمزنگاری اسناد</Text>
                <Text style={styles.conditionText}>
                  ایجاد اسناد با قابلیت امضاء یک یا چند طرفه
                </Text>
                <Text style={styles.conditionText}>
                  تهیه فرایندهای امضای پرتکرار
                </Text>
                <Text style={styles.conditionText}>
                  مدیریت سطوح دسترسی اشخاص حقوقی
                </Text>
                <Text style={styles.conditionText}>تهیه گزارش‌های مدیریتی</Text>
              </View>
              <Text>
                <Text>&nbsp;</Text>
              </Text>
              <Text style={styles.textTitle}>
                شرایط و ضوابط استفاده از خدمات ارائه‌شده در پاراف
              </Text>
              <Text style={styles.textTitle}>اهلیت قانونی</Text>
              <View style={{paddingRight: 15}}>
                <Text style={styles.conditionText}>
                  باتوجه به امکان ارائه خدمات به اشخاصی که واجد اهلیت قانونی و
                  حداقل سن قانونی 18 سال تمام جهت امضاء سند هستند، ایجاد حساب
                  کاربری توسط کاربر به منزله اذعان ایشان به وجود اهلیت و حداقل
                  سن قانونی است، که البته این موضوع در فرایند احراز هویت سرزمین
                  هوشمند پاد مورد بررسی قرار گرفته و به اشخاصی که واجد این شرط
                  نباشند، اجازه ایجاد حساب کاربری داده نمی‌شود.
                </Text>
              </View>
              <Text style={styles.conditionText}>هزینه خدمات</Text>
              <View style={{paddingRight: 15}}>
                <Text style={styles.conditionText}>
                  کلیه هزینه‌های مرتبط با ایجاد امضاء الکترونیک بر عهده کاربر
                  است. همچنین درصورتی که کاربر مایل به ایجاد گواهی امضاء
                  الکترونیکی مرکز ریشه وزارت صمت باشد ملزم است هزینه دریافت
                  گواهی مذکور را نیز به صورت جداگانه پرداخت نماید. جز در خصوص
                  مواردی که ذکر شد، هیچگونه هزینه دیگری از کاربر برای ایجاد
                  امضاء الکترونیک در پاراف دریافت نمی‌شود.
                </Text>
                <Text style={styles.conditionText}>
                  کاربر به ازاء بارگذاری هر سند هزینه جداگانه‌ای را که به طور
                  مشخص به اطلاع ایشان می‌رسد، پرداخت می‌نماید.
                </Text>
                <Text style={styles.conditionText}>
                  اطلاعات مربوط به حساب و کارت بانکی شما در زمان پرداخت
                  هزینه‌های مرتبط با احراز هویت در پاراف ذخیره و نگهداری نشده و
                  عملیات پرداخت از طریق کیف الکترونیکی پول کاربر در سرزمین
                  هوشمند پاد و درگاه پرداخت الکترونیکی کارتی شاپرک صورت
                  می‌پذیرد.
                </Text>
              </View>
              <Text>&nbsp;</Text>
              <Text style={styles.textTitle}>ایجاد امضاء الکترونیک</Text>
              <View style={{paddingRight: 15}}>
                <Text style={styles.conditionText}>
                  چنانچه کاربر مایل به بارگذاری سند به منظور امضاء آن باشد،
                  امضاء کاربر -به عنوان امضاءکننده- در زمان بارگذاری سند تولید
                  شده و ضمیمه آن می‌شود. در همین راستا پس از بارگذاری سند از
                  جانب کاربر، پیامکی مبنی بر اطلاع‌رسانی بارگذاری سند از جانب
                  کاربر و لزوم ورود مخاطب سند به لینک پیوست پیامک جهت امضاء آن،
                  برای مخاطب سند ارسال می‌شود. مخاطب سند از طریق ورود به لینک
                  یاد شده، نصب نرم‌افزار و ایجاد حساب کاربری می‌تواند نسبت به
                  امضاء سند اقدام نماید.
                </Text>
              </View>
              <Text>&nbsp;</Text>
              <Text>
                <Text style={styles.textTitle}>مسئولیت کاربر</Text>
              </Text>
              <View style={{paddingRight: 15}}>
                <Text style={styles.conditionText}>
                  مسئولیت حفاظت از رمز عبور ورود به حساب کاربری برعهده کاربر
                  است. باتوجه به آنکه در هر بار ورود کاربر به حساب کاربری رمز
                  عبور به صورت OTP به شماره تلفن همراه اعلام‌شده توسط کاربر
                  ارسال می‌شود، مسئولیت حفاظت از تلفن همراه و هرگونه استفاده از
                  پیامک‌های حاوی رمز عبور دریافتی بر عهده کاربر است. در غیر این
                  صورت پاراف هیچگونه مسئولیتی بر عهده نداشته و کاربر حق هرگونه
                  ادعا و اعتراضی در این خصوص را از خود سلب و ساقط می‌نماید. لازم
                  به ذکر است باتوجه به ارسال رمز عبور حساب کاربری به شماره تلفن
                  همراه کاربر که امکان ورود به حساب کاربری و امضاء سند یا اسناد
                  را فراهم می‌آورد، کاربر ملزم و متعهد است اقدامات احتیاطی لازم
                  در راستای حفاظت از تلفن همراه خود را شخصا بر عهده داشته باشد.
                  در غیر این صورت مسئولیت هرگونه سوء استفاده شخص یا اشخاص ثالث
                  از تلفن همراه کاربر و اطلاعات موجود در تلفن همراه ایشان، بر
                  عهده کاربر است.
                </Text>
                <Text style={styles.conditionText}>
                  هرگونه فعالیتی که توسط کاربر در حساب کاربری ایشان صورت پذیرد
                  منتسب به کاربر بوده و پاراف هیچگونه مسئولیتی از حیث فعالیت‌های
                  صورت‌گرفته در حساب کاربری بر عهده نخواهد داشت. در همین راستا
                  هرگونه مسئولیت حفظ و نگهداری از حساب کاربری، رمز ورود به حساب
                  کاربری و هرسخت‌افزاری که حساب کاربری در آن پیاده‌سازی شده باشد
                  -اعم از آنکه در قالب نسخه نرم‌افزاری سیستم (های) کامپیوتری
                  بوده و یا در قالب اپلیکیشن در تلفن همراه کاربر مورد استفاده
                  باشد- بر عهده کاربر بوده و ایشان ملزم است به محض اطلاع از
                  هرگونه نقض امنیت یا استفاده غیرمجاز از حساب کاربری خود، پاراف
                  را مطلع نماید.
                </Text>
                <Text style={styles.conditionText}>
                  امکان استفاده از خدمات ارائه‌شده در پاراف به هرنحو که منجر به
                  تخلف از قوانین و مقررات جمهوری اسلامی ایران باشد، ممنوع بوده و
                  در صورت ارتکاب آن توسط کاربر، ایشان مسئول تمامی عواقب قانونی و
                  قضائی آن شناخته می‌شود.
                </Text>
              </View>
              <Text style={styles.textTitle}>تخلفات</Text>
              <View style={{paddingRight: 15}}>
                <Text style={styles.conditionText}>
                  موارد ممنوعیت فعالیت‌ (های) کاربر در حساب کاربری ایشان از طریق
                  خدمات ارائه‌شده در پاراف به شرح ذیل به تایید و موافقت ایشان
                  رسیده و کاربر هرگونه ادعا و اعتراضی در خصوص عدم اطلاع از
                  ممنوعیت‌های یاد شده را از خود سلب و ساقط می‌نماید. انجام هریک
                  از موارد ممنوعیت توسط کاربر در پاراف، تخلف محسوب شده و ایشان
                  در صورت بروز تخلف مسئول شناخته می‌شود. موارد ممنوعیت عبارتند
                  از:
                </Text>
              </View>
              <View style={{paddingRight: 15}}>
                <Text style={styles.conditionText}>
                  هر گونه فعالیت غیرقانونی اعم از بارگذاری و یا ارسال هرگونه
                  محتوای غیر قانونی، جعلی، مضر، تهدیدآمیز، مبتذل، ناپسند و افترا
                  آمیز
                </Text>
                <Text style={styles.conditionText}>
                  هرگونه فعالیت با هدف تعرض به حریم خصوصی شخص یا اشخاص ثالث
                </Text>
                <Text style={styles.conditionText}>
                  هرگونه فعالیت با هدف جعل هویت هر شخص حقیقی یا حقوقی
                </Text>
                <Text style={styles.conditionText}>
                  بارگذاری یا ارسال هرگونه محتوایی که ناقض حق ثبت اختراع، علامت
                  تجاری، اسرار تجاری، حق چاپ و یا سایر حقوق متعلق به هر شخص اعم
                  از امضاءکننده (گان) و یا شخص یا اشخاص ثالث باشد.
                </Text>
                <Text style={styles.conditionText}>
                  بارگذاری یا ارسال هرگونه محتوایی که حاوی ویروس‌های نرم‌افزاری
                  یا هرگونه کد رایانه‌ای، فایل ها یا برنامه‌هایی باشد که برای
                  قطع ، از بین‌بردن یا محدود کردن عملکرد هر گونه نرم‌افزار
                  رایانه یا سخت‌افزار یا تجهیزات مخابراتی طراحی شده است.
                </Text>
                <Text style={styles.conditionText}>
                  ایجاد اختلال در خدمات، سرورها یا شبکه‌های متصل به خدمات
                </Text>
                <Text style={styles.conditionText}>
                  نقض عمدی یا سهوی هرگونه قوانین یا مقررات ملی یا بین‌المللی و
                  یا حقوق بنیادین یا حقوق بشر
                </Text>
                <Text style={styles.conditionText}>
                  ایجاد مزاحمت و آزار برای شخص یا اشخاص ثالث
                </Text>
                <Text style={styles.conditionText}>
                  جمع‌آوری یا ذخیره اطلاعات شخصی سایر کاربران
                </Text>
              </View>
              <View style={{paddingRight: 15}}>
                <Text style={styles.conditionText}>
                  مستند به ماده 6 قانون تجارت الکترونیک مصوب سال 1382 درخصوص
                  مواردی که در زیر اشاره می‌شود، امکان امضاء الکترونیک وجود
                  ندارد. بنابراین هریک از کاربران نسبت به ممنوعیت‌های قانونی
                  آگاه بوده و چنانچه خلاف آن عمل نماید، مسئول کلیه عواقب قانونی
                  آن شناخته می‌شود و پاراف هیچگونه مسئولیتی از حیث امضاء اسنادی
                  که شامل موارد ذیل باشد، بر عهده نخواهد داشت. ممنوعیت‌های
                  استفاده از امضاء الکترونیک عبارتند از:
                </Text>
              </View>
              <View style={{paddingRight: 15}}>
                <Text style={styles.conditionText}>
                  اسناد مالکیت اموال غیرمنقول
                </Text>
                <Text style={styles.conditionText}>
                  فروش مواد داروئی به مصرف‌کنندگان نهایی
                </Text>
                <Text style={styles.conditionText}>
                  اعلام، اخطار، هشدار و یا عبارات مشابهی که دستور خاصی برای
                  استفاده کالا صادر می‌کند و یا از به‌کارگیری روش‌‌های خاصی به
                  صورت فعل یا ترک فعل منع می‌کند.
                </Text>
              </View>
              <Text>&nbsp;</Text>
              <Text>
                <Text style={styles.textTitle}>محرمانگی&nbsp; اسناد</Text>
              </Text>
              <View style={{paddingRight: 15}}>
                <Text style={styles.conditionText}>
                  پاراف معتقد است حفظ حریم خصوصی کاربران مهم است و خود را متعهد
                  به حفاظت از آن می‌داند. در این راستا از سند سیاست‌های حریم
                  خصوصی پاد (مندرج در ... ) تبعیت می‌نماید کهدر برگیرنده خط مشی
                  پاد در جمع آوری و پردازش اطلاعات کاربران&nbsp;است.&nbsp;
                  کلیه&nbsp; اسناد بارگذاری‌شده در پاراف با استفاده از زیرساخت
                  رمزنگاری pki رمزگذاری دوطرفه شده و به صورت محرمانه در نظر
                  گرفته می‌شود و پاراف راسا هیچگونه دسترسی به&nbsp; اسناد
                  بارگذاری‌شده توسط هریک از کاربران نخواهد داشت. علاوه بر این،
                  پاراف امکان دسترسی به&nbsp; اسناد بارگذاری‌شده توسط هریک از
                  کاربران را برای هیچ شخصی به غیر از کاربر و مخاطبانی که به
                  عنوان امضاکننده تعیین می‌شود فراهم نخواهد کرد و با توجه به
                  اینکه کلید عمومی رمزگشایی اسناد مذکور مستقیما توسط زیرساخت
                  بانکداری دیجیتالی بانک پاسارگاد به صورت اختصاصی برای کاربر
                  ایجاد شده و در اختیار ایشان قرار می‌گیرد، حتی پاراف نیز امکان
                  رمزگشایی و مشاهده آن اطلاعات را نخواهد داشت. لازم به ذکر است
                  تنها استثناء ناظر به ارائه اطلاعات مرتبط با اسناد بارگذاری‌شده
                  توسط هریک از کاربران اعم از زمان بارگذاری سند، اطلاعات طرفین و
                  غیره، دستور مرجع ذی‌صلاح قضائی بوده و با حکم مرجع ذی‌صلاح
                  قضائی، بانک پاسارگاد مجاز به ارائه اطلاعات یاد شده شناخته
                  می‌شود. البته در این شرایط نیز امکان دسترسی پاراف به محتوای
                  سند وجود نداشته و صرفا با رضایت حداقل یکی از اشخاصی که به سند
                  دسترسی دارند، ارائه اطلاعات مربوط به سند به مرجع یاد شده
                  امکانپذیر است. کاربر و مخاطب سند که امضاءکنندگان آتی سند
                  شناخته می‌شوند نسبت به این موضوع آگاه بوده و موافقت خود را
                  اعلام می‌نمایند.
                </Text>
                <Text style={styles.conditionText}>
                  خدمات و محصولات پاراف با ویژگی‌های امنیتی بالا ایجاد شده‌ است.
                  پاراف جهت نگهداری امن و حفاظت از اطلاعات کاربران و جلوگیری از
                  دسترسی غیر مجاز تمام توان خود را به کار می‌گیرد و نحوۀ مدیریت
                  داده‌ها و لایه‌های امنیتی فیزیکی و نرم‌افزاری در سرورهای پاراف
                  به نحوی است که مانع از دسترسی غیرمجاز به اطلاعات می‌شود.
                </Text>
                <Text style={styles.conditionText}>
                  پاراف با هدف حفظ امنیت خدمات و محصولات خود و جلوگیری از
                  فعالیت‌های غیرقانونی چون کلاهبرداری برای ورود کاربران خود از
                  روش ارسال کد تأیید به شماره همراه استفاده می‌کند، لیکن این
                  اطلاعات تماس نزد پاراف محفوظ خواهد ماند. این اطلاعات جهت
                  کارکردهای داخل برنامه به طور مثال در زمان ثبت‌نام و ورود مورد
                  استفاده قرار خواهد گرفت. همچنین به منظور دسترسی به خدمات امضای
                  الکترونیک مشخصات فردی کاربر (از قبیل تاریخ تولد و کد ملی) و
                  ویدیوی زندۀ ایشان درخواست می‌شود. این اطلاعات صرفاً به منظور
                  تطبیق اطلاعات دریافتی با اطلاعات موجود در ثبت احوال و احراز
                  هویت کاربر است.
                </Text>
                <Text style={styles.conditionText}>
                  پاراف اسناد را با استفاده از روش رمزگذاری نامتقارن و استاندارد
                  PKI رمزنگاری می‌کند که بالاترین سطح امنیت و پذیرش جهانی را
                  دارد، رمزنگاری می‌نماید. رمزنگاری باعث می‌شود تا تنها صاحب سند
                  و افرادی که ایشان تعیین می‌کند به محتوای سند دسترسی داشته
                  باشندو پاراف هیچ گونه دسترسی‌ای به محتوای اسناد نخواهد داشت و
                  سند در امنیت و محرمانگی کامل قرار دارد.
                </Text>
              </View>
              <Text>
                <Text style={styles.textTitle}>حقوق مالکیت فکری و معنوی</Text>
              </Text>
              <View style={{paddingRight: 15}}>
                <Text style={styles.conditionText}>
                  تمام حقوق مادی و معنوی پاراف متعلق به پدیدآورنده است و هرگونه
                  کپی‌برداری از این حقوق اعم از تقلید لوگو، گرافیک محصول، نام
                  تجاری، نام دامنه، محتوا و غیره به گونه‌ای که منحصر به موارد
                  مذکور نیست، تخلف محسوب شده و پیگیرد قانونی خواهد داشت.
                </Text>
              </View>
              <Text>
                <Text style={styles.textTitle}>حل و فصل اختلاف</Text>
              </Text>
              <Text style={styles.conditionText}>
                بدیهی است در صورت بروز اختلاف بین هریک از کاربران پاراف در خصوص
                اسناد امضاء شده فی‌مابین ایشان و اشخاص ثالث تابع قوانین جمهوری
                اسلامی ایران است. در همین راستا هریک از کاربران می‌پذیرند که
                مرجع صالح در رسیدگی به دعاوی ایشان به طرفیت پاراف یا بالعکس،
                مرجع ذی‌صلاح قضائی شهر تهران است.
              </Text>
              <Text>
                <Text>&nbsp;</Text>
              </Text>
              <Text style={styles.conditionText}>
                لازم به ذکر است هرگونه بروزرسانی شرایط و ضوابط استفاده از خدمات
                ارائه‌شده در پاراف به اطلاع دارندگان حساب کاربری -اعم از آنکه
                کاربر و یا مخاطب سند باشند- رسیده و ادامه فعالیت کاربر به منزله
                تایید و پذیرش شرایط استفاده از خدمات ارائه‌شده در پاراف است.
                &nbsp;در غیر این صورت حساب کاربری مسدود شده و امکان ادامه ارائه
                خدمات به دارندگان حساب کاربری -اعم از آنکه کاربر و یا مخاطب سند
                باشند- وجود نخواهد داشت.
              </Text>
            </View>
          </ScrollView>

          <View style={styles.btnWrapper}>
            <View style={styles.btn}>
              <Button
                title="بستن"
                disabled={false}
                loading={false}
                onPress={goBack}
                type="danger"
              />
            </View>
          </View>
        </View>
      </View>
    </>
  );
};

export default Index;
